---
kind: type
id: T:Autodesk.Revit.DB.DirectShapeReferenceOptions
source: html/c77da180-10dd-8e8a-d5d4-01cfc06135e5.htm
---
# Autodesk.Revit.DB.DirectShapeReferenceOptions

This class is used to control the behavior of DirectShape and DirectShapeType reference objects.

## Syntax (C#)
```csharp
public class DirectShapeReferenceOptions : IDisposable
```